-- --------------------------------------------------------
-- ホスト:                          hosplist.kawasaki-m.ac.jp
-- サーバーのバージョン:                   8.0.41 - Source distribution
-- サーバー OS:                      Linux
-- HeidiSQL バージョン:               12.11.0.7065
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--  テーブル hosplistdb.area の構造をダンプしています
DROP TABLE IF EXISTS `area`;
CREATE TABLE IF NOT EXISTS `area` (
  `are_cd` int NOT NULL,
  `area_name` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `sec_cd` int NOT NULL,
  `area1` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `area2` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `city` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `zone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `town` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  PRIMARY KEY (`sec_cd`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- テーブル hosplistdb.area: ~60 rows (約) のデータをダンプしています
INSERT INTO `area` (`are_cd`, `area_name`, `sec_cd`, `area1`, `area2`, `city`, `zone`, `town`) VALUES
	(1, '県南東部', 33101, '岡山市北区', '岡山市北区', '岡山市', '北区', ''),
	(1, '県南東部', 33102, '岡山市中区', '岡山市中区', '岡山市', '中区', ''),
	(1, '県南東部', 33103, '岡山市東区', '岡山市東区', '岡山市', '東区', ''),
	(1, '県南東部', 33104, '岡山市南区', '岡山市南区', '岡山市', '南区', ''),
	(2, '県南西部', 33202, '倉敷市', '倉敷市', '倉敷市', '', ''),
	(5, '津山･英田', 33203, '津山市', '津山市', '津山市', '', ''),
	(1, '県南東部', 33204, '玉野市', '玉野市', '玉野市', '', ''),
	(2, '県南西部', 33205, '笠岡市', '笠岡市', '笠岡市', '', ''),
	(2, '県南西部', 33207, '井原市', '井原市', '井原市', '', ''),
	(2, '県南西部', 33208, '総社市', '総社市', '総社市', '', ''),
	(3, '高梁･新見', 33209, '高梁市', '高梁市', '高梁市', '', ''),
	(3, '高梁･新見', 33210, '新見市', '新見市', '新見市', '', ''),
	(1, '県南東部', 33211, '備前市', '備前市', '備前市', '', ''),
	(1, '県南東部', 33212, '瀬戸内市', '瀬戸内市', '瀬戸内市', '', ''),
	(1, '県南東部', 33213, '赤磐市', '赤磐市', '赤磐市', '', ''),
	(4, '真庭', 33214, '真庭市', '真庭市', '真庭市', '', ''),
	(5, '津山･英田', 33215, '美作市', '美作市', '美作市', '', ''),
	(2, '県南西部', 33216, '浅口市', '浅口市', '浅口市', '', ''),
	(1, '県南東部', 33346, '和気郡和気町', '和気郡和気町', '和気郡', '', '和気町'),
	(2, '県南西部', 33423, '都窪郡早島町', '都窪郡早島町', '都窪郡', '', '早島町'),
	(2, '県南西部', 33445, '浅口郡里庄町', '浅口郡里庄町', '浅口郡', '', '里庄町'),
	(2, '県南西部', 33461, '小田郡矢掛町', '小田郡矢掛町', '小田郡', '', '矢掛町'),
	(4, '真庭', 33586, '真庭郡新庄村', '真庭郡新庄村', '真庭郡', '', '新庄村'),
	(5, '津山･英田', 33606, '苫田郡鏡野町', '苫田郡鏡野町', '苫田郡', '', '鏡野町'),
	(5, '津山･英田', 33622, '勝田郡勝央町', '勝田郡勝央町', '勝田郡', '', '勝央町'),
	(5, '津山･英田', 33623, '勝田郡奈義町', '勝田郡奈義町', '勝田郡', '', '奈義町'),
	(5, '津山･英田', 33643, '英田郡西粟倉村', '英田郡西粟倉村', '英田郡', '', '西粟倉村'),
	(5, '津山･英田', 33663, '久米郡久米南町', '久米郡久米南町', '久米郡', '', '久米南町'),
	(5, '津山･英田', 33666, '久米郡美咲町', '久米郡美咲町', '久米郡', '', '美咲町'),
	(1, '県南東部', 33681, '加賀郡吉備中央町', '加賀郡吉備中央町', '加賀郡', '', '吉備中央町'),
	(6, '他県', 34101, '広島県', '広島市中区', '広島市', '中区', ''),
	(6, '他県', 34102, '広島県', '広島市東区', '広島市', '東区', ''),
	(6, '他県', 34103, '広島県', '広島市南区', '広島市', '南区', ''),
	(6, '他県', 34104, '広島県', '広島市西区', '広島市', '西区', ''),
	(6, '他県', 34105, '広島県', '広島市安佐南区', '広島市', '安佐南区', ''),
	(6, '他県', 34106, '広島県', '広島市安佐北区', '広島市', '安佐北区', ''),
	(6, '他県', 34107, '広島県', '広島市安芸区', '広島市', '安芸区', ''),
	(6, '他県', 34108, '広島県', '広島市佐伯区', '広島市', '佐伯区', ''),
	(6, '他県', 34202, '広島県', '呉市', '呉市', '', ''),
	(6, '他県', 34203, '広島県', '竹原市', '竹原市', '', ''),
	(6, '他県', 34204, '広島県', '三原市', '三原市', '', ''),
	(6, '他県', 34205, '広島県', '尾道市', '尾道市', '', ''),
	(6, '他県', 34207, '広島県', '福山市', '福山市', '', ''),
	(6, '他県', 34208, '広島県', '府中市', '府中市', '', ''),
	(6, '他県', 34209, '広島県', '三次市', '三次市', '', ''),
	(6, '他県', 34210, '広島県', '庄原市', '庄原市', '', ''),
	(6, '他県', 34211, '広島県', '大竹市', '大竹市', '', ''),
	(6, '他県', 34212, '広島県', '東広島市', '東広島市', '', ''),
	(6, '他県', 34213, '広島県', '廿日市市', '廿日市市', '', ''),
	(6, '他県', 34214, '広島県', '安芸高田市', '安芸高田市', '', ''),
	(6, '他県', 34215, '広島県', '江田島市', '江田島市', '', ''),
	(6, '他県', 34302, '広島県', '安芸郡府中町', '安芸郡', '', '府中町'),
	(6, '他県', 34304, '広島県', '安芸郡海田町', '安芸郡', '', '海田町'),
	(6, '他県', 34307, '広島県', '安芸郡熊野町', '安芸郡', '', '熊野町'),
	(6, '他県', 34309, '広島県', '安芸郡坂町', '安芸郡', '', '坂町'),
	(6, '他県', 34368, '広島県', '山県郡安芸太田町', '山県郡', '', '安芸太田町'),
	(6, '他県', 34369, '広島県', '山県郡北広島町', '山県郡', '', '北広島町'),
	(6, '他県', 34431, '広島県', '豊田郡大崎上島町', '豊田郡', '', '大崎上島町'),
	(6, '他県', 34462, '広島県', '世羅郡世羅町', '世羅郡', '', '世羅町'),
	(6, '他県', 34545, '広島県', '神石郡神石高原町', '神石郡', '', '神石高原町');

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
