-- --------------------------------------------------------
-- ホスト:                          hosplist.kawasaki-m.ac.jp
-- サーバーのバージョン:                   8.0.41 - Source distribution
-- サーバー OS:                      Linux
-- HeidiSQL バージョン:               12.11.0.7065
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--  テーブル hosplistdb.field_junction の構造をダンプしています
DROP TABLE IF EXISTS `field_junction`;
CREATE TABLE IF NOT EXISTS `field_junction` (
  `hos_cd` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT '',
  `hos_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `fie_div` varchar(15) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `fie_name` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `tel` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `fax` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `note` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `delete_flg` int NOT NULL DEFAULT '0',
  `fie_cd` int NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`fie_cd`),
  KEY `hos_cd` (`hos_cd`),
  KEY `fie_div` (`fie_div`)
) ENGINE=InnoDB AUTO_INCREMENT=8299 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- テーブル hosplistdb.field_junction: ~66 rows (約) のデータをダンプしています
INSERT INTO `field_junction` (`hos_cd`, `hos_name`, `fie_div`, `fie_name`, `tel`, `fax`, `note`, `delete_flg`, `fie_cd`) VALUES
	('0116169', '岡山西大寺病院', '連携', '地域医療連携室直通', '086-942-0161', '', '', 0, 931),
	('0210608', '川崎医科大学附属病院', '外来', 'テスト', '999-999-9999', '999-999-9999', 'テスト', 0, 2272),
	('0213040', 'まび記念病院', '連携', '地域連携室・入退院支援室', '086-697-5075', '', '', 0, 2507),
	('1516739', '福山南病院', '', '地域医療連携室', '084-920-5052', '084-956-0033', '', 0, 8234),
	('0207141', 'つばめクリニック', '', '', '', '', '', 0, 8235),
	('2810108', 'ポルソ矢掛クリニック', '', '', '', '', '', 0, 8236),
	('1516648', '福山RKクリニック', '', '', '', '', '', 0, 8237),
	('0116862', '木下医院せのお駅前', '', '', '', '', '', 0, 8238),
	('1600062', 'にしした泌尿器科クリニック', '', '', '', '', '', 0, 8239),
	('2510335', '広島県立総合リハビリテーションセンター　医療センター', '外来', '高次脳機能センター', '', '082-425-1375', '', 0, 8240),
	('1516606', '明神町リハ・整形クリニック', '', '', '', '', '', 0, 8241),
	('0124080', 'ココイロクリニック', '', '', '', '', '', 0, 8242),
	('0116763', 'トリニティクリニック', '', '', '', '', '', 0, 8243),
	('0124056', '岡山耳鼻咽喉科クリニック', '', '', '', '', '', 0, 8244),
	('0126191', '医療法人社団生和会　広島はくしま病院', '', '', '', '', '', 0, 8245),
	('1516572', 'みよし耳鼻咽喉科', '', '', '', '', '', 0, 8246),
	('0205034', 'だいふく歯科', '', '', '', '', '', 0, 8247),
	('0210794', 'まびデンタルクリニック＆', '', '', '', '', '', 0, 8248),
	('0205026', 'いしいデンタルクリニック', '', '', '', '', '', 0, 8249),
	('0111152', '医療法人創和会　重井医学研究所附属病院', '連携', '入退院支援センター直通', '086-282-5360', '086-282-4447', '', 0, 8250),
	('0124098', 'のなか内科腎診療所', '', '', '', '', '', 0, 8251),
	('1000669', 'いとうファミリークリニック', '', '', '', '', '', 0, 8252),
	('1112364', '神田ファミリークリニック', '', '', '', '', '', 0, 8253),
	('0115740', '心臓病センター榊原病院', '連携', '地域医療連携室', '086-225-7711', '', '医療機関専用', 0, 8254),
	('0115740', '心臓病センター榊原病院', '連携', '医療福祉相談室', '086-221-1186', '086-223-5245', '医療機関専用', 0, 8255),
	('0124106', 'こでら内科・糖尿病クリニック', '', '', '', '', '', 0, 8256),
	('1516788', 'びんご整形外科クリニック', '', '', '', '', '', 0, 8257),
	('0124114', 'KMR　CLINIC', '', '', '', '', '', 0, 8258),
	('0205091', 'まった歯科', '', '', '', '', '', 0, 8259),
	('1516580', 'みよし内科', '', '', '', '', '', 0, 8260),
	('0207166', '倉敷脳神経内科クリニック', '', '', '', '', '', 0, 8261),
	('2610185', 'しげい腎クリニック早島', '', '', '', '', '', 0, 8262),
	('0911899', 'しまなみ皮ふ科', '', '', '', '', '', 0, 8263),
	('8900416', '井原市立井原市民病院', '連携', '地域医療連携室', '0866-62-1231', '0866-63-2840', '2024.12.1～', 0, 8264),
	('1516713', '周治ファミリークリニック', '', '', '', '', '', 0, 8265),
	('0124130', '岡山きずの訪問診療所', '', '', '', '', '', 0, 8266),
	('0310937', '在宅クリニック　ホームケアプラス', '', '', '', '', '', 0, 8267),
	('0126696', 'オクノクリニック広島駅前院', '', '', '', '', '', 0, 8268),
	('0116904', 'のぞみクリニックあかいわ', '', '', '', '', '', 0, 8269),
	('0207208', 'ごとうだ内科・内視鏡クリニック', '', '', '', '', '', 0, 8270),
	('8903196', 'たまの病院', '', '', '', '', '', 0, 8271),
	('0205059', 'こむぎ歯科', '', '', '', '', '', 0, 8272),
	('0124171', '公園前クリニック', '', '', '', '', '', 0, 8273),
	('0120274', 'ふたば川入歯科クリニック', '', '', '', '', '', 0, 8274),
	('0207216', 'くろずみ内科クリニック　糖尿病・甲状腺・内分泌', '', '', '', '', '', 0, 8275),
	('0124197', 'けやき通り整形外科クリニック', '', '', '', '', '', 0, 8276),
	('0213537', 'みずしま協同クリニック', '', '', '', '', '', 0, 8277),
	('0124189', 'おおひらクリニック', '', '', '', '', '', 0, 8278),
	('0207224', 'むしあけ在宅ケアクリニック', '', '', '', '', '', 0, 8279),
	('0205133', 'めぐり歯科こども歯科室', '', '', '', '', '', 0, 8280),
	('3610259', '勝央診療所', '', '', '', '', '', 0, 8281),
	('0800677', 'おの歯科医院', '', '', '', '', '', 0, 8282),
	('0205109', 'ささおき歯科', '', '', '', '', '', 0, 8283),
	('0111687', 'グラン岡山歯科・矯正歯科', '', '', '', '', '', 0, 8284),
	('0205125', 'よねだ歯科医院', '', '', '', '', '', 0, 8285),
	('0110626', '総合病院　岡山協立病院', '連携', '地域医療連携室', '086-271-0917', '086-271-1986', '', 0, 8286),
	('0207240', '児島内科・ハートクリニック', '', '', '', '', '', 0, 8287),
	('0124221', '本荘耳鼻咽喉科医院', '', '', '', '', '', 0, 8288),
	('0116946', '青山こども岡山中央クリニック', '', '', '', '', '', 0, 8289),
	('0207158', '倉敷ふじ眼科', '', '', '', '', '', 0, 8290),
	('0116888', '西口アーバンクリニック', '', '', '', '', '', 0, 8291),
	('0124247', 'おかやま腎泌尿器科クリニック', '', '', '', '', '', 0, 8292),
	('0500798', 'Ｙ’ｓ歯科クリニック', '', '', '', '', '', 0, 8293),
	('0205075', 'いろは歯科オーラルケアクリニック', '', '', '', '', '', 0, 8294),
	('2300910', 'ほのぼのファミリークリニック', '', '', '', '', '', 0, 8295),
	('0207232', 'たぬメンタルクリニック', '', '', '', '', '', 0, 8296),
	('0124254', 'ふたばクリニック', '', '', '', '', '', 0, 8297),
	('0124031', 'くろだクリニック', '', '', '', '', '', 0, 8298);

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
