-- --------------------------------------------------------
-- ホスト:                          hosplist.kawasaki-m.ac.jp
-- サーバーのバージョン:                   8.0.41 - Source distribution
-- サーバー OS:                      Linux
-- HeidiSQL バージョン:               12.11.0.7065
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--  テーブル hosplistdb.insert_log の構造をダンプしています
DROP TABLE IF EXISTS `insert_log`;
CREATE TABLE IF NOT EXISTS `insert_log` (
  `hos_cd` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `hos_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `log_data` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `user_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `user_id` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `ins` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `bel` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `adm_user` varchar(2) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  PRIMARY KEY (`hos_cd`,`log_data`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='新規追加ログ';

-- テーブル hosplistdb.insert_log: ~67 rows (約) のデータをダンプしています
INSERT INTO `insert_log` (`hos_cd`, `hos_name`, `log_data`, `user_name`, `user_id`, `ins`, `bel`, `adm_user`) VALUES
	('0111687', 'グラン岡山歯科・矯正歯科', '2025-07-01 11:01:07', '田村　由記江', 'k0098014', '0', '0', '1'),
	('0116763', 'トリニティクリニック', '2024-05-09 11:19:21', '田村　由記江', 'k0098014', '0', '0', '1'),
	('0116805', '川崎医科大学高齢者医療センター', '2023-09-21 17:37:34', '田村　由記江', 'k0098014', '0', '0', '1'),
	('0116821', 'MANA乳腺甲状腺クリニック', '2023-10-07 09:47:49', '田村　由記江', 'k0098014', '0', '0', '1'),
	('0116862', '木下医院せのお駅前', '2024-04-05 16:48:24', '小野　由起', 'k0111326', '0', '0', '1'),
	('0116888', '西口アーバンクリニック', '2025-08-05 16:26:55', '田村　由記江', 'k0098014', '0', '0', '1'),
	('0116904', 'のぞみクリニックあかいわ', '2025-01-10 10:33:36', '小野　由起', 'k0111326', '0', '0', '1'),
	('0116946', '青山こども岡山中央クリニック', '2025-07-08 17:36:14', '小野　由起', 'k0111326', '0', '0', '1'),
	('0120134', 'はれのひデンタルクリニック', '2023-09-13 18:57:51', '田村　由記江', 'k0098014', '0', '0', '1'),
	('0120142', 'かえで歯科クリニック', '2023-09-13 19:01:52', '田村　由記江', 'k0098014', '0', '0', '1'),
	('0120274', 'ふたば川入歯科クリニック', '2025-03-24 11:16:27', '田村　由記江', 'k0098014', '0', '0', '1'),
	('0123991', 'うらべ内科クリニック', '2023-07-01 12:09:09', '美甘　勝士', 'k0122464', '0', '0', '1'),
	('0124015', 'ふたば医院', '2023-11-01 14:14:34', '浅野　由紀子', 'k0903267', '0', '2', '1'),
	('0124023', '杜の街 ひらまつ内科クリニック', '2023-11-30 17:42:34', '今田　憲吾', 'K1994003', '1', '0', '1'),
	('0124031', 'くろだクリニック', '2025-09-08 14:02:21', '今田　憲吾', 'K1994003', '1', '0', '1'),
	('0124056', '岡山耳鼻咽喉科クリニック', '2024-05-30 08:55:46', '小野　由起', 'k0111326', '0', '0', '1'),
	('0124080', 'ココイロクリニック', '2024-05-01 15:56:25', '小野　由起', 'k0111326', '0', '0', '1'),
	('0124098', 'のなか内科腎診療所', '2024-07-05 15:58:15', '小野　由起', 'k0111326', '0', '0', '1'),
	('0124106', 'こでら内科・糖尿病クリニック', '2024-08-07 14:57:52', '小野　由起', 'k0111326', '0', '0', '1'),
	('0124114', 'KMR　CLINIC', '2024-09-09 14:46:41', '小野　由起', 'k0111326', '0', '0', '1'),
	('0124130', '岡山きずの訪問診療所', '2024-11-25 14:54:51', '小野　由起', 'k0111326', '0', '0', '1'),
	('0124171', '公園前クリニック', '2025-03-07 16:20:54', '小野　由起', 'k0111326', '0', '0', '1'),
	('0124189', 'おおひらクリニック', '2025-06-09 14:00:32', '小野　由起', 'k0111326', '0', '0', '1'),
	('0124197', 'けやき通り整形外科クリニック', '2025-05-13 15:25:06', '小野　由起', 'k0111326', '0', '0', '1'),
	('0124221', '本荘耳鼻咽喉科医院', '2025-07-08 17:23:55', '小野　由起', 'k0111326', '0', '0', '1'),
	('0124247', 'おかやま腎泌尿器科クリニック', '2025-08-12 09:04:18', '小野　由起', 'k0111326', '0', '0', '1'),
	('0124254', 'ふたばクリニック', '2025-09-08 09:29:19', '小野　由起', 'k0111326', '0', '0', '1'),
	('0126191', '医療法人社団生和会　広島はくしま病院', '2024-06-06 15:48:32', '浅野　由紀子', 'k0903267', '0', '2', '1'),
	('0126696', 'オクノクリニック広島駅前院', '2024-12-13 16:12:17', '浅野　由紀子', 'k0903267', '0', '2', '1'),
	('0205026', 'いしいデンタルクリニック', '2024-06-18 15:52:39', '田村　由記江', 'k0098014', '0', '0', '1'),
	('0205034', 'だいふく歯科', '2024-06-14 12:03:37', '田村　由記江', 'k0098014', '0', '0', '1'),
	('0205059', 'こむぎ歯科', '2025-02-26 11:30:29', '田村　由記江', 'k0098014', '0', '0', '1'),
	('0205075', 'いろは歯科オーラルケアクリニック', '2025-08-28 09:39:09', '田村　由記江', 'k0098014', '0', '0', '1'),
	('0205091', 'まった歯科', '2024-09-14 12:32:31', '小野　由起', 'k0111326', '0', '0', '1'),
	('0205109', 'ささおき歯科', '2025-06-11 15:36:53', '田村　由記江', 'k0098014', '0', '0', '1'),
	('0205125', 'よねだ歯科医院', '2025-07-02 09:48:31', '田村　由記江', 'k0098014', '0', '0', '1'),
	('0205133', 'めぐり歯科こども歯科室', '2025-06-09 14:32:47', '小野　由起', 'k0111326', '0', '0', '1'),
	('0207091', 'よこやま内科・循環器内科', '2023-07-18 12:24:20', '小野　由起', 'k0111326', '0', '0', '1'),
	('0207117', 'ふくま整形外科クリニック', '2023-08-10 12:26:04', '小野　由起', 'k0111326', '0', '0', '1'),
	('0207125', '寒川医院', '2023-12-05 16:16:18', '小野　由起', 'k0111326', '0', '0', '1'),
	('0207141', 'つばめクリニック', '2024-02-07 12:45:58', '小野　由起', 'k0111326', '0', '0', '1'),
	('0207158', '倉敷ふじ眼科', '2025-07-31 14:36:26', '田村　由記江', 'k0098014', '0', '0', '1'),
	('0207166', '倉敷脳神経内科クリニック', '2024-10-07 12:46:56', '小野　由起', 'k0111326', '0', '0', '1'),
	('0207208', 'ごとうだ内科・内視鏡クリニック', '2025-02-12 12:22:33', '小野　由起', 'k0111326', '0', '0', '1'),
	('0207216', 'くろずみ内科クリニック　糖尿病・甲状腺・内分泌', '2025-04-10 08:25:28', '小野　由起', 'k0111326', '0', '0', '1'),
	('0207224', 'むしあけ在宅ケアクリニック', '2025-06-09 14:20:22', '小野　由起', 'k0111326', '0', '0', '1'),
	('0207232', 'たぬメンタルクリニック', '2025-09-02 10:16:34', '田村　由記江', 'k0098014', '0', '0', '1'),
	('0207240', '児島内科・ハートクリニック', '2025-07-08 15:57:47', '小野　由起', 'k0111326', '0', '0', '1'),
	('0210794', 'まびデンタルクリニック＆', '2024-06-18 15:08:41', '田村　由記江', 'k0098014', '0', '0', '1'),
	('0213529', '倉敷てんげん眼科', '2023-12-07 17:21:34', '小野　由起', 'k0111326', '0', '0', '1'),
	('0213537', 'みずしま協同クリニック', '2025-06-07 11:03:01', '田村　由記江', 'k0098014', '0', '0', '1'),
	('0310937', '在宅クリニック　ホームケアプラス', '2024-11-25 17:20:59', '小野　由起', 'k0111326', '0', '0', '1'),
	('0500798', 'Ｙ’ｓ歯科クリニック', '2025-08-14 09:28:21', '田村　由記江', 'k0098014', '0', '0', '1'),
	('0800677', 'おの歯科医院', '2025-06-09 15:22:01', '小野　由起', 'k0111326', '0', '0', '1'),
	('0911899', 'しまなみ皮ふ科', '2024-11-16 10:17:05', '田村　由記江', 'k0098014', '0', '0', '1'),
	('1000669', 'いとうファミリークリニック', '2024-07-05 16:10:20', '小野　由起', 'k0111326', '0', '0', '1'),
	('1112364', '神田ファミリークリニック', '2024-07-08 14:05:20', '田村　由記江', 'k0098014', '0', '0', '1'),
	('1516572', 'みよし耳鼻咽喉科', '2024-06-07 08:41:17', '田村　由記江', 'k0098014', '0', '0', '1'),
	('1516580', 'みよし内科', '2024-09-21 09:07:28', '田村　由記江', 'k0098014', '0', '0', '1'),
	('1516606', '明神町リハ・整形クリニック', '2024-04-26 15:01:13', '田村　由記江', 'k0098014', '0', '0', '1'),
	('1516648', '福山RKクリニック', '2024-03-11 13:59:27', '田村　由記江', 'k0098014', '0', '0', '1'),
	('1516713', '周治ファミリークリニック', '2024-11-20 15:00:21', '田村　由記江', 'k0098014', '0', '0', '1'),
	('1516739', '福山南病院', '2024-01-12 16:23:54', '田村　由記江', 'k0098014', '0', '0', '1'),
	('1516788', 'びんご整形外科クリニック', '2024-08-29 15:00:44', '田村　由記江', 'k0098014', '0', '0', '1'),
	('1600062', 'にしした泌尿器科クリニック', '2024-04-05 17:02:33', '小野　由起', 'k0111326', '0', '0', '1'),
	('2300910', 'ほのぼのファミリークリニック', '2025-09-02 10:06:58', '田村　由記江', 'k0098014', '0', '0', '1'),
	('2610185', 'しげい腎クリニック早島', '2024-10-07 13:00:56', '小野　由起', 'k0111326', '0', '0', '1'),
	('2711487', 'みやじまアイクリニック', '2023-10-14 10:27:01', '田村　由記江', 'k0098014', '0', '0', '1'),
	('2810108', 'ポルソ矢掛クリニック', '2024-02-20 15:21:07', '田村　由記江', 'k0098014', '0', '0', '1'),
	('3610259', '勝央診療所', '2025-06-09 15:04:16', '小野　由起', 'k0111326', '0', '0', '1'),
	('8903196', 'たまの病院', '2025-02-25 14:27:01', '田村　由記江', 'k0098014', '0', '0', '1');

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
