-- --------------------------------------------------------
-- ホスト:                          hosplist.kawasaki-m.ac.jp
-- サーバーのバージョン:                   8.0.41 - Source distribution
-- サーバー OS:                      Linux
-- HeidiSQL バージョン:               12.11.0.7065
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--  テーブル hosplistdb.message の構造をダンプしています
DROP TABLE IF EXISTS `message`;
CREATE TABLE IF NOT EXISTS `message` (
  `id` int NOT NULL AUTO_INCREMENT,
  `situation` int NOT NULL DEFAULT '0',
  `req_date` date NOT NULL,
  `res_date` date NOT NULL,
  `comment` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `req_fac` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `req_dep` text CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `view` int NOT NULL DEFAULT '0',
  `version` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=114 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC;

-- テーブル hosplistdb.message: ~86 rows (約) のデータをダンプしています
INSERT INTO `message` (`id`, `situation`, `req_date`, `res_date`, `comment`, `req_fac`, `req_dep`, `view`, `version`) VALUES
	(2, 11, '2022-11-15', '2022-11-15', 'ユーザー管理で、ユーザー名に括弧及び空白が記入できるように修正', '附', '医療資料部', 1, NULL),
	(3, 11, '2022-11-15', '2022-11-15', 'ユーザー管理で、ユーザー検索機能を追加', '附', '医療資料部', 1, NULL),
	(4, 11, '2022-11-15', '2022-11-15', 'EXCELのファイル出力、詳細シートの診療科の表記を1→○へ', '附', '医療資料部', 1, ''),
	(5, 11, '2022-11-22', '2022-11-22', 'データベースを入れ替えて検索が出るようにしました。(岡山市と糖内)', '総', '地域連携室', 1, NULL),
	(6, 11, '2022-11-22', '2022-11-22', '郵便番号で郵便区番号と町域小ブロック番号の検索に11', '総', '地域連携室', 1, NULL),
	(7, 11, '2022-11-22', '2022-11-22', 'EXCEL出力に「区」項目の追加', '附', '働き方', 1, NULL),
	(8, 11, '2022-11-22', '2022-11-22', 'ユーザー管理のUI改善', '福祉大', '医療情報学科', 1, NULL),
	(9, 11, '2022-11-24', '2022-11-24', '検索ができるように対応。SQL文がANDかORにするかの対応', 'その他', '総）地域連携室、附）働き方', 1, NULL),
	(10, 11, '2022-11-24', '2022-11-24', '理事長・院長検索で、ラジオボタンにチェックがあるのに検索項目がない場合のエラー表示', '福祉大', '医療情報学科', 1, NULL),
	(11, 11, '2022-11-24', '2022-11-24', '変更で、確認画面から変更処理ができるように対応しました。', '附', '地域連携室', 1, NULL),
	(12, 11, '2022-11-29', '2022-11-29', '病院区分で検索ができるようにしました。', '附', 'MSW', 1, NULL),
	(13, 11, '2022-11-29', '2022-11-29', '文字の大きさを少し大きくしました。', '福祉大', '医療情報学科', 1, NULL),
	(14, 11, '2022-11-29', '2022-11-29', '郵便番号を1つの項目で、5桁・6桁・全一致の検索をできるようにしました。', '総', '地域連携室', 1, NULL),
	(15, 11, '2022-11-29', '2022-11-29', '検索条件の指定なしを非表示にしました。', '附', '働き方', 1, NULL),
	(16, 11, '2022-12-06', '2022-12-06', '親族情報、診療科・部門連絡先の複数入力ができるようにしました。', '附', '地域連携室', 1, NULL),
	(17, 11, '2022-12-06', '2022-12-06', '「医療機関新規追加」機能 を実装しました。', '附', '医療資料部', 1, NULL),
	(18, 11, '2022-12-06', '2022-12-06', '記載例の文字色を調整しました。', '附', '地域連携室', 1, NULL),
	(19, 11, '2022-12-21', '2022-12-21', '理事長・院長表記の修正', '附', '働き方', 1, NULL),
	(20, 11, '2022-12-21', '2022-12-21', '医療機関新規追加・医療機関コードの二重登録の禁止', '附', '医療資料部', 1, NULL),
	(21, 11, '2023-01-11', '2023-01-11', '検索結果の印刷対応', '総', '地域連携室', 1, NULL),
	(22, 11, '2023-01-11', '2023-01-11', '新規医療機関追加が真っ白になる', '附', '医療資料部', 1, NULL),
	(23, 11, '2023-01-11', '2023-01-11', 'ユーザー管理のページングの表示件数の追加', '福祉大', '医療情報学科', 1, NULL),
	(24, 11, '2023-01-11', '2023-01-11', 'データベースの最新版作成', '附', '医療資料部', 1, NULL),
	(25, 11, '2023-01-11', '2023-01-11', '備考欄のバイト数の調整', '附', '働き方', 1, NULL),
	(26, 11, '2023-01-11', '2023-01-11', '医療機関コードの7桁制限', '附', '地域連携室', 1, NULL),
	(27, 11, '2023-03-02', '2023-03-02', '診療日と手術日の調整', '附', '働き方', 1, NULL),
	(28, 11, '2023-03-02', '2023-03-02', '医療機関の新規登録画面、郵便番号、都道府県、地区コード３項目の入力必須', '附', '医療資料部', 1, NULL),
	(29, 11, '2023-03-02', '2023-03-02', '医療機関詳細画面、郵便番号、都道府県、地区コード３項目の入力必須', '附', '医療資料部', 1, NULL),
	(30, 11, '2023-03-15', '2023-03-15', '利用者「附属病院の医事課」の追加', '附', '医療資料部', 1, NULL),
	(31, 11, '2023-03-15', '2023-03-15', '地区コードの「二次医療圏を選択」の文言の削除', '附', '医療資料部', 1, NULL),
	(32, 11, '2023-03-15', '2023-03-15', '更新後の不具合修正', '附', '働き方', 1, NULL),
	(33, 11, '2023-03-15', '2023-03-15', '各曜日のチェックボックス', '附', '医療資料部', 1, NULL),
	(34, 11, '2023-03-15', '2023-03-15', '地域と地区コードを詳細画面及び新規、変更に追加', '福祉大', '医療情報学科', 1, NULL),
	(35, 11, '2023-03-15', '2023-03-15', '変更・新規の診察日などの全選択チェックボックス', '福祉大', '医療情報学科', 1, NULL),
	(36, 10, '2023-03-15', '0000-00-00', 'メンテナンス部分', '福祉大', '医療情報学科', 1, NULL),
	(37, 11, '2023-03-29', '2023-03-29', '変更後、検索結果で変更が反映される', '附', '働き方', 1, NULL),
	(38, 11, '2023-03-29', '2023-03-29', 'EXCELファイル出力エラー', '附', '働き方', 1, NULL),
	(39, 11, '2023-03-29', '2023-03-29', 'ユーザー変更の氏名未入力防止・アラートアイコン追加', '福祉大', '医療情報学科', 1, NULL),
	(40, 11, '2023-03-29', '2023-03-29', 'パスワード変更・初期化にアラートアイコン追加', '福祉大', '医療情報学科', 1, NULL),
	(41, 11, '2023-04-04', '2023-04-04', 'メールアドレス機能実装', '附', '働き方', 1, NULL),
	(42, 11, '2023-04-04', '2023-04-04', '表示名の修正', '附', '医療資料部', 1, NULL),
	(43, 11, '2023-04-04', '2023-04-04', '管理者以外でログインした時、「診療時間・診療科等」タブの診療科の部分にある「全選択」チェックボックスを削除', '附', '医療資料部', 1, NULL),
	(44, 11, '2023-04-04', '2023-04-04', '診療時間の中央揃えを左寄せにする', '附', '医療資料部', 1, NULL),
	(45, 11, '2023-04-07', '2023-04-07', '医科チェックボックス', '附', '企画', 1, NULL),
	(46, 11, '2023-05-10', '2023-05-10', '地域必須入力', '附', '医療資料部', 1, NULL),
	(47, 11, '2023-05-10', '2023-05-10', '病院庶務課の部署追加', '附', '医療資料部', 1, NULL),
	(48, 11, '2023-05-16', '2023-05-16', '病院庶務課の部署追加の修正', '附', '医療資料部', 1, NULL),
	(49, 11, '2023-05-25', '2023-05-25', '市区町村自動入力', '福祉大', '医療情報学科', 1, NULL),
	(50, 11, '2023-05-25', '2023-05-25', '都道府県・地域・地区コードの表示連動化', '福祉大', '医療情報学科', 1, NULL),
	(51, 11, '2023-06-26', '2023-06-26', '「連携状況」タブ 医療連携懇話会参加年度', '附', '医療資料部', 1, NULL),
	(52, 11, '2023-06-26', '2024-04-09', '「院外支援・研修」タブ フィルタ機能', '附', '医療資料部', 1, NULL),
	(53, 10, '2023-06-26', '0000-00-00', '総合医療センター 紹介・逆紹介データインポート', '附', '医療資料部', 1, NULL),
	(54, 11, '2023-06-27', '2023-06-27', '新規追加ログ', '附', '医療資料部', 1, NULL),
	(55, 11, '2023-06-27', '2023-06-27', '削除ログ', '附', '医療資料部', 1, NULL),
	(56, 11, '2023-06-27', '2023-06-27', '後半「紹介・逆紹介」タブ', '附', '医療資料部', 1, NULL),
	(57, 11, '2023-06-27', '2023-06-27', '後半「院外支援・研修」タブ', '附', '医療資料部', 1, NULL),
	(58, 11, '2023-06-27', '2023-06-27', '後半「連携状況」タブ', '附', '医療資料部', 1, NULL),
	(59, 11, '2023-06-27', '2023-06-27', '後半「診療内容」タブ', '附', '医療資料部', 1, NULL),
	(60, 11, '2023-06-27', '2023-06-27', '「連携状況」タブの画面の一番上に、カルナコネクト登録済みの項目を作成', '附', '医療資料部', 1, NULL),
	(61, 11, '2023-06-27', '2023-06-27', '画面ﾚｲｱｳﾄについての相談No.34・35', '附', '医療資料部', 1, NULL),
	(62, 11, '2023-06-27', '2023-06-27', 'カルナコネクトについて　登録済みの横もしくは下に注釈追加', '附', '医療資料部', 1, NULL),
	(63, 11, '2023-07-04', '2023-07-04', '「診療内容」タブ 項目修正', '附', '医療資料部', 1, NULL),
	(64, 11, '2023-07-13', '2023-07-13', 'EXCEL出力、コンタクト履歴非表示', '附', '医療資料部', 1, NULL),
	(65, 11, '2023-11-14', '2023-11-14', '全件CSVエクスポート機能追加', '附', '医療資料部', 1, NULL),
	(66, 11, '2023-11-14', '2023-11-14', 'ログイン画面改修（ログの表示およびマニュアル表示）', '附', '医療資料部', 1, NULL),
	(67, 11, '2023-11-27', '2023-11-27', '連携状況タブ　医療連携懇話会参加年度導入', '附', '医療資料部', 1, NULL),
	(68, 11, '2023-11-27', '2023-11-27', 'ログイン画面修正（ログ表示）', '附', '医療資料部', 1, NULL),
	(69, 11, '2023-11-27', '2023-11-27', '詳細画面修正（備考欄表示）', '附', '医療資料部', 1, NULL),
	(70, 11, '2023-12-12', '2023-12-12', 'コンタクト履歴タブ導入', '附', '医療資料部', 1, NULL),
	(71, 11, '2023-12-18', '2023-12-18', 'コンタクト履歴タブのデータ降順表示', '附', '医療資料部　連携', 1, NULL),
	(72, 11, '2023-12-18', '2023-12-18', 'ログイン画面　対応状況・更新履歴のレイアウト調整', '附', '医療資料部', 1, NULL),
	(73, 11, '2023-12-19', '2023-12-19', '「院外支援・研修」タブ項目名称（院外支援研修→兼業）', '附', '医療資料部　', 1, NULL),
	(74, 11, '2023-12-19', '2023-12-19', '部門連絡先タブ　行追加・削除の修正', '附', '医療資料部', 1, NULL),
	(75, 11, '2023-12-04', '2024-04-09', '「コンタクト履歴」タブ　フィルタ機能実装', '附', '医療資料部', 1, NULL),
	(76, 11, '2023-12-04', '2023-12-04', '「紹介・逆紹介」タブ　高齢者医療センター追加', '附', '医療資料部', 1, NULL),
	(80, 11, '2024-03-11', '2024-03-11', 'コンタクト履歴の修正', '附', '医療資料部', 1, NULL),
	(81, 11, '2024-03-11', '2024-03-11', 'メッセージ機能の新規追加', '附', '医療資料部', 1, NULL),
	(93, 11, '2024-04-30', '2024-04-30', 'メンテナンス通知機能実装', '附', '医療資料部', 1, NULL),
	(94, 11, '2024-04-04', '2024-04-30', '兼業タブ内の表の項目変更', '附', '働き方', 1, NULL),
	(95, 11, '2024-04-15', '2024-04-30', '紹介、逆紹介タブ内の表背景色の修正', '附', '医療資料部', 1, NULL),
	(96, 11, '2024-04-15', '2024-04-30', '連携情報タブの権限変更', '附', '医療資料部', 1, NULL),
	(101, 11, '2024-07-23', '2024-07-23', 'コンタクト履歴、兼業データ更新', '附', '医療資料部', 1, NULL),
	(102, 11, '2024-07-23', '2024-07-23', '医療機関情報の変更前後の項目修正', '附', '医療資料部', 1, NULL),
	(103, 11, '2024-08-05', '2024-08-05', 'メンテナンスモードの実装', '附', '医療資料部', 1, '4.4.3'),
	(104, 11, '2024-06-18', '2024-06-18', '医療機関情報システムマニュアルの更新', '附', '医療資料部', 1, ''),
	(105, 11, '2022-11-15', '2022-11-15', 'ユーザー管理で、パスワード変更機能を追加', '附', '医療資料部', 1, ''),
	(106, 10, '2024-10-28', '2024-10-28', '紹介・逆紹介のインポート機能（β版）の導入', '附', '医療資料部', 1, '4.5.0'),
	(107, 11, '2024-10-28', '2024-10-28', '医療機関システムのバージョン管理機能', '附', '医療資料部', 1, '4.5.1'),
	(108, 11, '2024-11-18', '2024-11-18', '紹介・逆紹介のインポート機能（β版）にバックアップ機能実装', '附', '医療資料部', 1, '4.5.2'),
	(109, 11, '2025-05-26', '2025-05-26', 'お問い合わせ機能の導入', '附', '医療資料部', 1, '5.0.0'),
	(110, 11, '2025-06-30', '2025-07-07', '新権限「システム管理者」追加', '附', '医療資料部', 1, '6.0.0'),
	(111, 11, '2025-06-30', '2025-07-07', '自動ログアウト機能　追加', '附', '医療資料部', 1, '6.0.0'),
	(112, 11, '2025-06-30', '2025-07-07', 'マニュアル閲覧（ログイン時）　追加', '附', '医療資料部', 1, '6.0.0'),
	(113, 11, '2025-09-01', '2025-09-01', '自動ログアウト機能　時間修正(60分→30分)', '附', '医療資料部', 1, '6.0.1');

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
